1 Write a Python program to connect to MySQL and print the list of all available databases.

In [10]:
import mysql.connector

In [11]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Murali@29",
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000025E08EC6850>

In [12]:
cursor = mydb.cursor()

In [13]:
cursor.execute("DROP DATABASE school_db")

cursor.execute("CREATE DATABASE school_db")
cursor.execute("USE school_db")

2. Create a function in Python to create the tables (students, courses, enrollments) in school_db.

In [14]:
# Drop tables if they exist
cursor.execute("DROP TABLE IF EXISTS ENROLLMENTS")
cursor.execute("DROP TABLE IF EXISTS COURSES")
cursor.execute("DROP TABLE IF EXISTS STUDENTS")

# Students table
cursor.execute("""
CREATE TABLE STUDENTS (
    student_id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(255),
    age INT,
    grade VARCHAR(10),
    email VARCHAR(50)
)
""")

# Courses table
cursor.execute("""
CREATE TABLE COURSES (
    course_id INT AUTO_INCREMENT PRIMARY KEY,
    course_name VARCHAR(255),
    instructor VARCHAR(50)
)
""")

In [15]:
# Enrollments table
cursor.execute("""
CREATE TABLE ENROLLMENTS (
    enroll_id INT AUTO_INCREMENT PRIMARY KEY,
    student_id INT,
    course_id INT,
    FOREIGN KEY(student_id) REFERENCES STUDENTS(student_id),
    FOREIGN KEY(course_id) REFERENCES COURSES(course_id)
) 
""")

In [16]:
cursor.execute("SHOW DATABASES")
for x in cursor:
    print(x)

('games_db',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('school_db',)
('schools_db',)
('sys',)
('world',)

3. Write a Python program to insert multiple students and courses into the respective tables using executemany().

In [17]:
import pandas as pd
students=pd.read_csv("./students.csv")
courses=pd.read_csv("./courses.csv")
enrollments=pd.read_csv("./enrollments.csv")
print(students)
print(courses)
print(enrollments)

    student_id     name  age grade                email
0            1    Zane1   18     C     zane1@school.edu
1            2     Uma2   23     A     uma2@outlook.com
2            3   Wendy3   22     B     wendy3@yahoo.com
3            4  Xander4   22     A  xander4@outlook.com
4            5  Victor5   19     A    victor5@gmail.com
..         ...      ...  ...   ...                  ...
95          96    Ian96   25     C     ian96@school.edu
96          97   Mona97   22     C     mona97@gmail.com
97          98    Leo98   25     A     leo98@school.edu
98          99    Bob99   23     C    bob99@outlook.com
99         100  Paul100   19     B  paul100@outlook.com

[100 rows x 5 columns]
   course_id         course_name    instructor
0          1         Mathematics     Dr. Smith
1          2             Physics   Dr. Johnson
2          3           Chemistry     Dr. Brown
3          4             Biology     Prof. Lee
4          5             History  Prof. Wilson
5          6           Economics    Dr. Taylor
6          7    Computer Science   Prof. White
7          8  English Literature    Dr. Harris
8          9          Philosophy    Dr. Martin
9         10          Statistics   Prof. Clark
     enroll_id  student_id  course_id
0            1           1         10
1            2           2          6
2            3           3          8
3            4           4         10
4            5           5         10
..         ...         ...        ...
194        195          98          9
195        196          98          3
196        197          99          7
197        198          99          2
198        199         100          9

[199 rows x 3 columns]

In [18]:
# Courses  table
courses_sql = "INSERT INTO COURSES (course_name, instructor) VALUES (%s, %s)"
courses=list(courses[["course_name","instructor"]].itertuples(index=False,name=None))
cursor.executemany(courses_sql, courses)
mydb.commit()

In [19]:
cursor.execute("SELECT * FROM COURSES")
for crow in cursor.fetchall():
    print(crow)

(1, 'Mathematics', 'Dr. Smith')
(2, 'Physics', 'Dr. Johnson')
(3, 'Chemistry', 'Dr. Brown')
(4, 'Biology', 'Prof. Lee')
(5, 'History', 'Prof. Wilson')
(6, 'Economics', 'Dr. Taylor')
(7, 'Computer Science', 'Prof. White')
(8, 'English Literature', 'Dr. Harris')
(9, 'Philosophy', 'Dr. Martin')
(10, 'Statistics', 'Prof. Clark')

In [20]:
# Students  table
students_sql = "INSERT INTO STUDENTS (name,age,grade,email) VALUES (%s, %s,%s,%s)"
students_re=list(students[["name","age","grade","email"]].itertuples(index=False,name=None))
cursor.executemany(students_sql, students_re)
mydb.commit()

4. Fetch and print all rows from the students table in a tabular format

In [21]:
cursor.execute("SELECT * FROM STUDENTS")
for srow in cursor.fetchall():
    print(srow)

(1, 'Zane1', 18, 'C', 'zane1@school.edu')
(2, 'Uma2', 23, 'A', 'uma2@outlook.com')
(3, 'Wendy3', 22, 'B', 'wendy3@yahoo.com')
(4, 'Xander4', 22, 'A', 'xander4@outlook.com')
(5, 'Victor5', 19, 'A', 'victor5@gmail.com')
(6, 'Ian6', 19, 'D', 'ian6@outlook.com')
(7, 'Leo7', 22, 'A', 'leo7@gmail.com')
(8, 'Paul8', 24, 'B', 'paul8@outlook.com')
(9, 'Wendy9', 23, 'B', 'wendy9@school.edu')
(10, 'Leo10', 23, 'A', 'leo10@yahoo.com')
(11, 'Uma11', 18, 'C', 'uma11@school.edu')
(12, 'Rita12', 18, 'B', 'rita12@outlook.com')
(13, 'Yara13', 22, 'B', 'yara13@yahoo.com')
(14, 'Bob14', 19, 'C', 'bob14@outlook.com')
(15, 'Quincy15', 24, 'A', 'quincy15@school.edu')
(16, 'Tina16', 19, 'A', 'tina16@yahoo.com')
(17, 'Alice17', 25, 'B', 'alice17@outlook.com')
(18, 'Sam18', 20, 'B', 'sam18@gmail.com')
(19, 'Paul19', 23, 'A', 'paul19@school.edu')
(20, 'Victor20', 19, 'D', 'victor20@gmail.com')
(21, 'Frank21', 23, 'A', 'frank21@school.edu')
(22, 'Victor22', 18, 'A', 'victor22@yahoo.com')
(23, 'Karen23', 25, 'A', 'karen23@yahoo.com')
(24, 'Grace24', 24, 'D', 'grace24@gmail.com')
(25, 'Quincy25', 25, 'A', 'quincy25@school.edu')
(26, 'Mona26', 20, 'D', 'mona26@gmail.com')
(27, 'Uma27', 22, 'B', 'uma27@school.edu')
(28, 'Nina28', 23, 'B', 'nina28@yahoo.com')
(29, 'Ian29', 23, 'B', 'ian29@school.edu')
(30, 'Tina30', 23, 'A', 'tina30@outlook.com')
(31, 'Nina31', 22, 'B', 'nina31@school.edu')
(32, 'Hannah32', 21, 'A', 'hannah32@school.edu')
(33, 'David33', 25, 'D', 'david33@school.edu')
(34, 'Wendy34', 22, 'B', 'wendy34@yahoo.com')
(35, 'Frank35', 25, 'C', 'frank35@yahoo.com')
(36, 'Paul36', 22, 'D', 'paul36@outlook.com')
(37, 'Ian37', 21, 'D', 'ian37@school.edu')
(38, 'Paul38', 20, 'C', 'paul38@outlook.com')
(39, 'Hannah39', 18, 'A', 'hannah39@outlook.com')
(40, 'Zane40', 21, 'A', 'zane40@yahoo.com')
(41, 'Ian41', 24, 'D', 'ian41@outlook.com')
(42, 'Quincy42', 24, 'C', 'quincy42@gmail.com')
(43, 'Quincy43', 25, 'D', 'quincy43@gmail.com')
(44, 'Tina44', 19, 'C', 'tina44@outlook.com')
(45, 'Xander45', 23, 'C', 'xander45@yahoo.com')
(46, 'Zane46', 25, 'C', 'zane46@gmail.com')
(47, 'Eva47', 19, 'D', 'eva47@yahoo.com')
(48, 'Leo48', 22, 'B', 'leo48@outlook.com')
(49, 'Uma49', 25, 'A', 'uma49@school.edu')
(50, 'Bob50', 22, 'D', 'bob50@gmail.com')
(51, 'Karen51', 18, 'A', 'karen51@outlook.com')
(52, 'Hannah52', 23, 'A', 'hannah52@yahoo.com')
(53, 'Bob53', 21, 'C', 'bob53@outlook.com')
(54, 'Leo54', 18, 'C', 'leo54@yahoo.com')
(55, 'Yara55', 22, 'A', 'yara55@yahoo.com')
(56, 'Eva56', 19, 'C', 'eva56@school.edu')
(57, 'Nina57', 21, 'B', 'nina57@school.edu')
(58, 'Eva58', 20, 'A', 'eva58@yahoo.com')
(59, 'Oscar59', 21, 'B', 'oscar59@yahoo.com')
(60, 'Yara60', 18, 'B', 'yara60@gmail.com')
(61, 'Oscar61', 23, 'D', 'oscar61@gmail.com')
(62, 'Rita62', 23, 'C', 'rita62@gmail.com')
(63, 'Victor63', 20, 'D', 'victor63@yahoo.com')
(64, 'Xander64', 19, 'D', 'xander64@yahoo.com')
(65, 'Hannah65', 22, 'D', 'hannah65@school.edu')
(66, 'Nina66', 25, 'D', 'nina66@school.edu')
(67, 'Victor67', 18, 'A', 'victor67@outlook.com')
(68, 'Karen68', 18, 'A', 'karen68@school.edu')
(69, 'Grace69', 18, 'D', 'grace69@gmail.com')
(70, 'Jack70', 24, 'A', 'jack70@school.edu')
(71, 'Nina71', 23, 'B', 'nina71@outlook.com')
(72, 'Ian72', 22, 'D', 'ian72@gmail.com')
(73, 'Grace73', 19, 'A', 'grace73@yahoo.com')
(74, 'Grace74', 24, 'C', 'grace74@gmail.com')
(75, 'Quincy75', 23, 'D', 'quincy75@school.edu')
(76, 'Oscar76', 19, 'D', 'oscar76@school.edu')
(77, 'Grace77', 22, 'D', 'grace77@outlook.com')
(78, 'Ian78', 22, 'D', 'ian78@outlook.com')
(79, 'Xander79', 24, 'C', 'xander79@outlook.com')
(80, 'Tina80', 22, 'D', 'tina80@gmail.com')
(81, 'Wendy81', 20, 'A', 'wendy81@school.edu')
(82, 'Karen82', 23, 'B', 'karen82@outlook.com')
(83, 'Leo83', 18, 'C', 'leo83@outlook.com')
(84, 'Bob84', 18, 'A', 'bob84@school.edu')
(85, 'Rita85', 18, 'A', 'rita85@outlook.com')
(86, 'Alice86', 21, 'B', 'alice86@outlook.com')
(87, 'Sam87', 19, 'C', 'sam87@yahoo.com')
(88, 'Wendy88', 23, 'A', 'wendy88@yahoo.com')
(89, 'Tina89', 21, 'C', 'tina89@outlook.com')
(90, 'Zane90', 25, 'D', 'zane90@gmail.com')
(91, 'Tina91', 21, 'D', 'tina91@yahoo.com')
(92, 'Wendy92', 19, 'C', 'wendy92@gmail.com')
(93, 'Quincy93', 19, 'A', 'quincy93@gmail.com')
(94, 'Eva94', 24, 'C', 'eva94@school.edu')
(95, 'Tina95', 25, 'D', 'tina95@outlook.com')
(96, 'Ian96', 25, 'C', 'ian96@school.edu')
(97, 'Mona97', 22, 'C', 'mona97@gmail.com')
(98, 'Leo98', 25, 'A', 'leo98@school.edu')
(99, 'Bob99', 23, 'C', 'bob99@outlook.com')
(100, 'Paul100', 19, 'B', 'paul100@outlook.com')

5. Write a program to update the grade of a student (given student_id) via a Python input prompt.

In [22]:
sql = "UPDATE STUDENTS SET grade = %s WHERE student_id = %s"
student_id = int(input("Enter Student Id:"))
grade=input("Enter N(ew Grade:")
cursor.execute(sql,(grade,student_id))
mydb.commit()

6. Delete a student from the students table using Python input for student_id.

In [23]:
sql = "DELETE FROM STUDENTS WHERE name = %s"
val = ("Victor5",)
cursor.execute(sql, val)
mydb.commit()

7. Write a Python script to insert enrollment records linking students with their courses, ensuring foreign key integrity.

In [24]:
enrollments['student_id'] = enrollments['student_id'].astype(int)
enrollments['course_id'] = enrollments['course_id'].astype(int)

# fetch valid student_ids and course_ids
cursor.execute("SELECT student_id FROM students")
valid_students = {row[0] for row in cursor.fetchall()}

cursor.execute("SELECT course_id FROM courses")
valid_courses = {row[0] for row in cursor.fetchall()}

# filter only valid enrollments
valid_enrollments = [
    (row.student_id, row.course_id)
    for row in enrollments.itertuples(index=False)
    if row.student_id in valid_students and row.course_id in valid_courses
]

invalid_enrollments = [
    (row.student_id, row.course_id)
    for row in enrollments.itertuples(index=False)
    if row.student_id not in valid_students or row.course_id not in valid_courses
]

print(f"{len(valid_enrollments)} valid enrollments to insert.")
print(f"{len(invalid_enrollments)} invalid enrollments skipped:", invalid_enrollments[:10])

# insert valid enrollments
if valid_enrollments:
    sql = "INSERT INTO enrollments (student_id, course_id) VALUES (%s, %s)"
    cursor.executemany(sql, valid_enrollments)
    print("Inserted successfully.")
    mydb.commit()

196 valid enrollments to insert.
3 invalid enrollments skipped: [(5, 10), (5, 3), (5, 6)]
Inserted successfully.

8. Fetch all students enrolled in a particular course (given course_id as input).

In [25]:
course_id = int(input("Enter Course ID: "))

cursor.execute("""
SELECT s.student_id, s.name, s.age, s.grade, s.email
FROM enrollments e
JOIN students s ON e.student_id = s.student_id
WHERE e.course_id = %s
""", (course_id,))

rows = cursor.fetchall()

if rows:
    print("Students enrolled:")
    for row in rows:
        print(row)
else:
    print("No students found for this course.")

Students enrolled:
(7, 'Leo7', 22, 'A', 'leo7@gmail.com')
(10, 'Leo10', 23, 'A', 'leo10@yahoo.com')
(14, 'Bob14', 19, 'C', 'bob14@outlook.com')
(16, 'Tina16', 19, 'A', 'tina16@yahoo.com')
(17, 'Alice17', 25, 'B', 'alice17@outlook.com')
(19, 'Paul19', 23, 'A', 'paul19@school.edu')
(26, 'Mona26', 20, 'D', 'mona26@gmail.com')
(28, 'Nina28', 23, 'B', 'nina28@yahoo.com')
(30, 'Tina30', 23, 'A', 'tina30@outlook.com')
(46, 'Zane46', 25, 'C', 'zane46@gmail.com')
(48, 'Leo48', 22, 'B', 'leo48@outlook.com')
(58, 'Eva58', 20, 'A', 'eva58@yahoo.com')
(61, 'Oscar61', 23, 'D', 'oscar61@gmail.com')
(62, 'Rita62', 23, 'C', 'rita62@gmail.com')
(71, 'Nina71', 23, 'B', 'nina71@outlook.com')
(74, 'Grace74', 24, 'C', 'grace74@gmail.com')
(77, 'Grace77', 22, 'D', 'grace77@outlook.com')
(81, 'Wendy81', 20, 'A', 'wendy81@school.edu')
(89, 'Tina89', 21, 'C', 'tina89@outlook.com')
(91, 'Tina91', 21, 'D', 'tina91@yahoo.com')
(92, 'Wendy92', 19, 'C', 'wendy92@gmail.com')

9. Write a program to display students who are not enrolled in any course.

In [26]:
cursor.execute("""
SELECT s.student_id, s.name, s.age, s.grade, s.email
FROM students s
LEFT JOIN enrollments e ON s.student_id = e.student_id
WHERE e.student_id IS NULL
""")

rows = cursor.fetchall()

if rows:
    print("Students not enrolled in any course:")
    for row in rows:
        print(row)
else:
    print("✅ All students are enrolled in at least one course.")

✅ All students are enrolled in at least one course.

10. Perform an INNER JOIN between students and courses using Python to show student names along with the courses they are enrolled in.

In [27]:
# The SQL query for the INNER JOIN
sql_join = """
SELECT
    s.name AS student_name,
    c.course_name
FROM
    students AS s
INNER JOIN
    enrollments AS e ON s.student_id = e.student_id
INNER JOIN
    courses AS c ON e.course_id = c.course_id;
"""


for row in cursor.fetchall():
    print(row)

11. Write a Python function to search for a student by name (partial matches allowed using LIKE).

In [28]:
cursor.execute("SELECT * FROM STUDENTS WHERE grade LIKE 'A%'")
print(cursor.fetchall())

[(2, 'Uma2', 23, 'A', 'uma2@outlook.com'), (4, 'Xander4', 22, 'A', 'xander4@outlook.com'), (7, 'Leo7', 22, 'A', 'leo7@gmail.com'), (10, 'Leo10', 23, 'A', 'leo10@yahoo.com'), (15, 'Quincy15', 24, 'A', 'quincy15@school.edu'), (16, 'Tina16', 19, 'A', 'tina16@yahoo.com'), (19, 'Paul19', 23, 'A', 'paul19@school.edu'), (21, 'Frank21', 23, 'A', 'frank21@school.edu'), (22, 'Victor22', 18, 'A', 'victor22@yahoo.com'), (23, 'Karen23', 25, 'A', 'karen23@yahoo.com'), (25, 'Quincy25', 25, 'A', 'quincy25@school.edu'), (30, 'Tina30', 23, 'A', 'tina30@outlook.com'), (32, 'Hannah32', 21, 'A', 'hannah32@school.edu'), (39, 'Hannah39', 18, 'A', 'hannah39@outlook.com'), (40, 'Zane40', 21, 'A', 'zane40@yahoo.com'), (49, 'Uma49', 25, 'A', 'uma49@school.edu'), (51, 'Karen51', 18, 'A', 'karen51@outlook.com'), (52, 'Hannah52', 23, 'A', 'hannah52@yahoo.com'), (55, 'Yara55', 22, 'A', 'yara55@yahoo.com'), (58, 'Eva58', 20, 'A', 'eva58@yahoo.com'), (67, 'Victor67', 18, 'A', 'victor67@outlook.com'), (68, 'Karen68', 18, 'A', 'karen68@school.edu'), (70, 'Jack70', 24, 'A', 'jack70@school.edu'), (73, 'Grace73', 19, 'A', 'grace73@yahoo.com'), (81, 'Wendy81', 20, 'A', 'wendy81@school.edu'), (84, 'Bob84', 18, 'A', 'bob84@school.edu'), (85, 'Rita85', 18, 'A', 'rita85@outlook.com'), (88, 'Wendy88', 23, 'A', 'wendy88@yahoo.com'), (93, 'Quincy93', 19, 'A', 'quincy93@gmail.com'), (98, 'Leo98', 25, 'A', 'leo98@school.edu')]

12. Add a new column email to the students table using Python and update it with random values.

In [29]:
#cursor.execute("ALTER TABLE STUDENTS DROP COLUMN school_email")
cursor.execute("ALTER TABLE STUDENTS ADD COLUMN school_email VARCHAR(100)")
sql = "UPDATE STUDENTS SET school_email = %s WHERE name = %s"
val = ("art@artechsolution", "Uma2")
cursor.execute(sql, val)
mydb.commit()

13. Create a program to count how many students are enrolled per course and display results in descending order.

In [30]:
cursor.execute("""
SELECT c.course_name, COUNT(e.student_id) AS total_students
FROM courses c
LEFT JOIN enrollments e ON c.course_id = e.course_id
GROUP BY c.course_id, c.course_name
ORDER BY total_students DESC
""")

rows = cursor.fetchall()

print("Students enrolled per course (descending):")
for row in rows:
    print(f"{row[0]} → {row[1]} students")
mydb.commit()

Students enrolled per course (descending):
Chemistry → 27 students
Philosophy → 22 students
Mathematics → 21 students
History → 21 students
Computer Science → 21 students
Economics → 19 students
Biology → 18 students
Statistics → 18 students
Physics → 16 students
English Literature → 13 students

14. Write a Python script that accepts a course name as input and returns all enrolled students with their grades.

In [31]:
course_name = input("Enter course name: ")

cursor.execute("""
SELECT s.student_id, s.name, s.grade
FROM enrollments e
JOIN students s ON e.student_id = s.student_id
JOIN courses c ON e.course_id = c.course_id
WHERE c.course_name = %s
""", (course_name,))

rows = cursor.fetchall()

if rows:
    print(f"\nStudents enrolled in {course_name}:")
    for row in rows:
        print(f"ID: {row[0]}, Name: {row[1]}, Grade: {row[2]}")
else:
    print(f"No students found for course {course_name}.")
mydb.commit()

No students found for course 10.

15. Export the contents of the students table into a CSV file using Python.

In [32]:
import csv

cursor.execute("SELECT * FROM students")
rows = cursor.fetchall()

# Get column names
columns = [desc[0] for desc in cursor.description]

with open("students_export.csv", "w", newline="") as f:
    writer = csv.writer(f)
    writer.writerow(columns) 
    writer.writerows(rows)

print("Students table exported to students_export.csv")

Students table exported to students_export.csv


16. Write a Python program to import student data from a CSV file into the students table

17. Create a stored procedure in MySQL (e.g., GetStudentCourses(student_id)) and call it from Python

In [33]:
student_id = int(input("Enter Student ID: "))

# call stored procedure
cursor.callproc("GetStudentCourses", [student_id])

# fetch results
for result in cursor.stored_results():
    rows = result.fetchall()
    if rows:
        print(f"Courses for student {student_id}:")
        for r in rows:
            print(f"Student: {r[0]},  Course: {r[1]}")
    else:
        print(f"No courses found for student {student_id}.")

ProgrammingError: 1305 (42000): PROCEDURE school_db.GetStudentCourses does not exist

18. Handle exceptions in Python to gracefully catch duplicate entries (e.g., inserting a student with the same ID).

In [ ]:
try:
    sql = "INSERT INTO students (student_id, name, age, grade, email) VALUES (%s, %s, %s, %s, %s)"
    val = (1, "Alice", 20, "A", "alice@school.edu")   
    cursor.execute(sql, val)
    mydb.commit()
    print(" Student inserted successfully!")

except mysql.connector.IntegrityError as e:
    if e.errno == 1062:  
        print("Duplicate entry! Student with this ID already exists.")
    else:
        print(f"Error: {e}")

Duplicate entry! Student with this ID already exists.

19. Write a program to implement transactions in Python:
○ Insert a student
○ Enroll them in a course
○ Roll back if the second query fails

In [ ]:
from mysql.connector import Error

try:
    mydb.start_transaction()

    new_student = (101, 'Sam101', 20, 'B', 'sam101@school.edu')
    insert_student_query = """
        INSERT INTO Students (student_id, name, age, grade, email)
        VALUES (%s, %s, %s, %s, %s)
    """
    cursor.execute(insert_student_query, new_student)
    print("Student inserted successfully.")

    new_enrollment = (None, 101, 3) 
    enroll_query = """
        INSERT INTO Enrollments (enrollment_id, student_id, course_id)
        VALUES (%s, %s, %s)
    """
    cursor.execute(enroll_query, new_enrollment)
    print("Student enrolled successfully.")

    mydb.commit()
    print("Transaction committed.")

except Error as e:
    mydb.rollback()
    print("Transaction rolled back due to error:", e)
finally:
    if cursor:
        cursor.close()
    if mydb:
        mydb.close()

Transaction rolled back due to error: 1046 (3D000): No database selected

20. Close the database connection safely in Python, ensuring both cursor and connection are properly closed.

In [ ]:
if 'cursor' in locals() and cursor is not None:
        cursor.close()
        print("Cursor closed.")
        
if 'conn' in locals() and conn.is_connected():
        mydb.close()
        print("Connection closed.")

Cursor closed.